-- phpMyAdmin SQL Dump
-- version 4.7.7
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: 2018 年 5 月 25 日 15:03
-- サーバのバージョン： 10.1.30-MariaDB
-- PHP Version: 5.6.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `books`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `book_recommends`
--

CREATE TABLE `book_recommends` (
  `recommend_id` int(11) NOT NULL,
  `bookname` varchar(255) NOT NULL,
  `member_id` int(11) DEFAULT NULL,
  `reason` text NOT NULL,
  `book_pic` varchar(100) DEFAULT NULL,
  `book_del_flg` tinyint(1) NOT NULL DEFAULT '0',
  `created` datetime DEFAULT NULL,
  `modified` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `book_recommends`
--

INSERT INTO `book_recommends` (`recommend_id`, `bookname`, `member_id`, `reason`, `book_pic`, `book_del_flg`, `created`, `modified`) VALUES
(1, 'こちかめ', 3, '連載初期こそ、警察官として型破りな両津と仲間たちの仕事風景が話の中心だったが、次第に作者の秋本治の趣味や主張が大きく前面に押し出されていき、薀蓄の多いマニアックな話や流行・時事問題を皮肉るような話、人情的な感動話に加えギャグが一切ないシリアスなエピソードも描かれるようになった。連載が軌道に乗った中期以降も、世間の流行（主にサブカルチャー）を積極的に題材として取り入れ、緻密な取材とそれを活用する構成力、背景にまで細やかに気遣う丹念さ、機知に富む台詞回しや実験的なアイディアを特徴とした。', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(2, '僕のヒーロアカデミア', 1, '成績不振だった主人公が最高のヒーローを目指して成長していくヒーロー漫画作品。堀越耕平にとって3作目の連載作品となる。『赤マルジャンプ』2008 WINTERに掲載された読切『僕のヒーロー』を基に構想された。', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(3, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(4, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(5, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(6, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(7, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(8, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(9, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(10, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(11, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(12, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(13, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(14, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(15, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(16, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(17, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(18, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(19, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(20, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(21, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(22, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(23, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(24, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(25, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(26, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(27, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(28, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(29, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(30, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(31, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(32, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(33, '僕のヒーロアカデミア', 1, '数ある少年誌でも特に面白いはず！', '20180429210833IMG_0499.jpg', 0, '2018-04-30 07:34:26', '2018-05-24 11:41:49'),
(34, 'fdsfsafdas', 9, 'fdsafdsafa', '20180524133157iOS からアップロードされた画像.jpg', 0, '2018-05-11 20:45:35', '2018-05-25 02:19:23'),
(35, 'これができてるか確認', 9, 'これはどうよ', '20180511135940Yuta.LINE.PNG', 0, '2018-05-11 20:59:40', '2018-05-24 11:41:49'),
(36, 'fdさああああああああああああ', 9, 'fdさあああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ', '20180524133157iOS からアップロードされた画像.jpg', 0, '2018-05-11 21:00:14', '2018-05-25 02:19:55'),
(37, '', 9, '', '20180511154336IMG_0041.jpg', 0, '2018-05-11 22:43:36', '2018-05-24 11:41:49'),
(38, 'fsafdsa', 9, 'fsdafsdafsa', '20180524133157iOS からアップロードされた画像.jpg', 0, '2018-05-24 18:19:17', '2018-05-25 11:08:01'),
(39, 'fdsafdsfdsa', 9, 'fdsafdsafads', '20180524133157iOS からアップロードされた画像.jpg', 0, '2018-05-24 18:58:23', '2018-05-25 02:19:23'),
(40, '編集後', 13, '編集後', '20180524133157iOS からアップロードされた画像.jpg', 0, '2018-05-24 19:11:42', '2018-05-24 11:41:49'),
(41, 'テスト', 13, 'テスト', '20180524133309IMG_0613.JPG', 0, '2018-05-24 20:33:09', '2018-05-24 11:41:49'),
(42, '最終確認', 9, '最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認最終確認', '20180524172858kami.jpg', 0, '2018-05-25 00:28:58', '2018-05-25 11:08:01'),
(43, '最高', 11, '行こう！', '20180524173445S__12845059.jpg', 0, '2018-05-25 00:34:45', NULL),
(44, '最終テスト', 13, '最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト最終テスト', '20180525132317iOS からアップロードされた画像 (2).jpg', 0, '2018-05-25 20:23:17', NULL),
(45, 'テスト', 13, 'テスト', '20180525140741iOS からアップロードされた画像 (2).jpg', 0, '2018-05-25 21:07:41', NULL),
(46, 'テスト', 13, 'hogehogehoge', '20180525141125S__12845059.jpg', 0, '2018-05-25 21:11:25', NULL),
(47, 'hogehoge', 13, 'テスト', '20180525141138S__12845059.jpg', 0, '2018-05-25 21:11:38', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `book_recommends`
--
ALTER TABLE `book_recommends`
  ADD PRIMARY KEY (`recommend_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `book_recommends`
--
ALTER TABLE `book_recommends`
  MODIFY `recommend_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
